bmourit/ArduinoCore-GD32/cores/arduino/gd32/PortNames.h
/*
  Copyright (c) 2020, GigaDevice Semiconductor Inc.

  Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

  1. Redistributions of source code must retain the above copyright notice, this
     list of conditions and the following disclaimer.
  2. Redistributions in binary form must reproduce the above copyright notice,
     this list of conditions and the following disclaimer in the documentation
     and/or other materials provided with the distribution.
  3. Neither the name of the copyright holder nor the names of its contributors
     may be used to endorse or promote products derived from this software without
     specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef _PORTNAMES_H
#define _PORTNAMES_H

#include "gd32_def.h"

#ifdef __cplusplus
extern "C" {
#endif

//extern const uint32_t gpio_port[];
//extern const uint32_t gpio_pin[];

static inline uint32_t APORT_TO_GPORT(uint32_t port_num)
{
  uint32_t gpio_port = 0U;

  switch (port_num) {
    case 0:
      gpio_port = GPIOA;
      break;
    case 1:
      gpio_port = GPIOB;
      break;
    case 2:
      gpio_port = GPIOC;
      break;
    case 3:
      gpio_port = GPIOD;
      break;
    case 4:
      gpio_port = GPIOE;
      break;
    default:
      break;
  }

  return gpio_port;
}

#define APIN_TO_GPIN(pin)   (uint16_t)(1 << (pin))

typedef enum {
  FirstPort = 0x00,
  PORTA = FirstPort,
  PORTB,
  PORTC,
#if defined(GPIOD)
  PORTD,
#endif
#if defined(GPIOE)
  PORTE,
#endif
  PORTEND,
  LastPort = PORTEND - 1
} PortName;

#define GPIO_PORT_NUM (LastPort - FirstPort + 1)

#define GET_GPIO_PORT(p)  ((p < GPIO_PORT_NUM) ? APORT_TO_GPORT(p) : (uint32_t)NULL)

uint32_t set_gpio_port_clock(uint32_t port);

#ifdef __cplusplus
}
#endif

#endif
